# Pandas DataFrame iter()

In [1]:
import pandas as pd

In [3]:
data = pd.DataFrame({"":[],"":[]})

In [5]:
data = pd.DataFrame({"Name":["Archana","Mani","Thiru","Kalpana"],"Age":[21,24,22,26]})

In [6]:
data

      Name  Age
0  Archana   21
1     Mani   24
2    Thiru   22
3  Kalpana   26

In [7]:
 data.__iter__() # In general, map means iterable

In [8]:
g = data.__iter__()

In [9]:
for i in g:
    print(i)

Name
Age

In [10]:
for i in data.__iter__():
    print(i)

Name
Age

In [11]:
data = pd.read_csv("/Users/archanaqueen/Desktop/i18n/Daily Class/Pandas/Dataset_work/All-CSV-ML-Data-Files-Download-master/chicago.csv")

In [12]:
data

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00
...,...,...,...,...
32058,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,$87384.00
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00
32062,NaN,NaN,NaN,NaN

In [13]:
data.columns

Index(['Name', 'Position Title', 'Department', 'Employee Annual Salary'], dtype='object')

In [14]:
for i in data.__iter__():
    print(i)

Name
Position Title
Department
Employee Annual Salary